In [2]:
import pandas as pd

df = pd.read_csv('data.csv')
df

      Name  Math  Science
0    Alice    85       92
1      Bob    78       81
2  Charlie    90       87

In [7]:
df_filtered = df[(df['Math']) > 80 & (df['Science'] > 80)].sort_values('Math', ascending=False)
df_filtered

      Name  Math  Science
2  Charlie    90       87
0    Alice    85       92
1      Bob    78       81

In [9]:
df2 = pd.read_csv('data2.csv')
df2

      Name   Department  Salary
0    Alice  Engineering   90000
1      Bob           HR   60000
2  Charlie  Engineering   95000
3    David           HR   62000
4      Eve    Marketing   70000

In [11]:
df2.groupby('Department')['Salary'].mean()

Department
Engineering    92500.0
HR             61000.0
Marketing      70000.0
Name: Salary, dtype: float64

In [12]:
df3 = pd.read_csv("data3.csv")
df3

      Name  Subject  Score
0    Alice     Math   88.0
1      Bob     Math    NaN
2  Charlie  Science   91.0
3    David  Science    NaN
4      Eve     Math   79.0

In [ ]:
means = df3.groupby('Subject').mean(numeric_only=True)
means
df3.fillna(means)

         Score
Subject
Math      83.5
Science   91.0

      Name  Subject  Score
0    Alice     Math   88.0
1      Bob     Math    NaN
2  Charlie  Science   91.0
3    David  Science    NaN
4      Eve     Math   79.0

In [24]:
df3.groupby('Subject')['Score'].transform('first')

0    88.0
1    88.0
2    91.0
3    91.0
4    88.0
Name: Score, dtype: float64

In [30]:
df3['Score'].fillna(df3.groupby('Subject')['Score'].transform('mean'), inplace=True)

In [31]:
df3

      Name  Subject  Score
0    Alice     Math   88.0
1      Bob     Math   83.5
2  Charlie  Science   91.0
3    David  Science   91.0
4      Eve     Math   79.0

In [33]:
from io import StringIO

df4 = pd.read_csv(StringIO(
    """Region,Product,Sales
East,A,120
East,B,90
West,A,100
West,B,110
North,A,95
North,B,105"""
))
df4

  Region Product  Sales
0   East       A    120
1   East       B     90
2   West       A    100
3   West       B    110
4  North       A     95
5  North       B    105

In [35]:
pd.pivot_table(df4, ['Sales'], ['Region', 'Product'])

                Sales
Region Product
East   A          120
       B           90
North  A           95
       B          105
West   A          100
       B          110

In [ ]:
df4.groupby('Region').mean(numeric_only=True).max()

Sales    105.0
dtype: float64

In [40]:
df4.groupby('Region').mean(numeric_only=True).idxmax()

Sales    East
dtype: object

In [41]:
df = pd.read_csv(StringIO(
    """Fruit,Quantity
Apple,10
Banana,5
Apple,7
Orange,8
Banana,3"""
))

df

    Fruit  Quantity
0   Apple        10
1  Banana         5
2   Apple         7
3  Orange         8
4  Banana         3

In [42]:
df['Fruit'].unique()

array(['Apple', 'Banana', 'Orange'], dtype=object)

In [43]:
df.groupby('Fruit').sum(True)

        Quantity
Fruit
Apple         17
Banana         8
Orange         8

In [44]:
df = pd.read_csv(StringIO(
    """Name,Email
Alice,alice@example.com
Bob,bob@gmail.com
Charlie,charlie@yahoo.com"""
))
df

      Name              Email
0    Alice  alice@example.com
1      Bob      bob@gmail.com
2  Charlie  charlie@yahoo.com

In [51]:
df['Email'].str.split('@', n=1).str[1]

0    example.com
1      gmail.com
2      yahoo.com
Name: Email, dtype: object

In [52]:
df = pd.read_csv(StringIO(
    """Name,Date,Score
Alice,2023-12-31,88
Bob,2024-01-15,92
Charlie,2024-06-10,85"""
))
df

      Name        Date  Score
0    Alice  2023-12-31     88
1      Bob  2024-01-15     92
2  Charlie  2024-06-10     85

In [53]:
df['d'] = pd.to_datetime(df['Date'])
df

      Name        Date  Score          d
0    Alice  2023-12-31     88 2023-12-31
1      Bob  2024-01-15     92 2024-01-15
2  Charlie  2024-06-10     85 2024-06-10

In [56]:
df[df['d'] > '2024']

      Name        Date  Score          d
1      Bob  2024-01-15     92 2024-01-15
2  Charlie  2024-06-10     85 2024-06-10

In [57]:
df1 = pd.read_csv(StringIO(
    """ID,Name
1,Alice
2,Bob
3,Charlie"""
))

df2 =  pd.read_csv(StringIO("""ID,Score
2,90
3,85
4,88"""))

In [58]:
df1

   ID     Name
0   1    Alice
1   2      Bob
2   3  Charlie

In [59]:
df2

   ID  Score
0   2     90
1   3     85
2   4     88

In [64]:
df3 = df1.merge(right=df2, how='inner', on='ID')

In [65]:
df3

   ID     Name  Score
0   2      Bob     90
1   3  Charlie     85

In [66]:
df = pd.read_csv(StringIO("""Class,Subject,Score
A,Math,88
A,Science,92
B,Math,81
B,Science,85
A,Math,90
B,Science,87"""))
df

  Class  Subject  Score
0     A     Math     88
1     A  Science     92
2     B     Math     81
3     B  Science     85
4     A     Math     90
5     B  Science     87

In [71]:
d = df.pivot_table('Score', index=['Class', 'Subject'], aggfunc='mean')

In [77]:
d.iloc[1]

Score    92
Name: (A, Science), dtype: int64

In [78]:
import sklearn as sk
import numpy as np
X = np.array([[1], [2], [3], [4], [5]])
y = np.array([2, 4, 6, 8, 10])

In [80]:
from sklearn.model_selection import train_test_split

x_train, x_test, y_train, y_test = train_test_split(X, y, test_size=0.2)

In [81]:
# Example predictions, Given a classifier and test data, use scikit-learn to compute the accuracy, precision, and recall.
from sklearn.metrics import accuracy_score, precision_score, recall_score

y_true = [0, 1, 1, 0, 1, 0]
y_pred = [0, 1, 0, 0, 1, 1]


print(f"{accuracy_score(y_true, y_pred)=}")
print(f"{precision_score(y_true, y_pred)=}")
print(f"{recall_score(y_true, y_pred)=}")

accuracy_score(y_true, y_pred)=0.6666666666666666
precision_score(y_true, y_pred)=0.6666666666666666
recall_score(y_true, y_pred)=0.6666666666666666

In [82]:
# 4

data = {
    'age': [25, 32, 47, 51, 62],
    'income': [50000, 64000, 120000, 110000, 150000],
    'target': [0, 0, 1, 1, 1]
}

df = pd.DataFrame(data)
X = df[['age', 'income']]
y = df['target']

In [84]:
from sklearn.preprocessing import StandardScaler
from sklearn.pipeline import make_pipeline
from sklearn.linear_model import LogisticRegression

pipeline = make_pipeline(
    StandardScaler(),
    LogisticRegression()
)

pipeline.fit(X, y)

Pipeline(steps=[('standardscaler', StandardScaler()),
                ('logisticregression', LogisticRegression())])

In [85]:
import pandas as pd

data = {
    'feature1': [2, 4, 5, 7, 8, 9, 10, 12, 13, 15],
    'feature2': [1, 3, 5, 7, 9, 11, 13, 15, 17, 19],
    'target':    [0, 0, 0, 1, 1, 1, 0, 1, 0, 1]
}

df = pd.DataFrame(data)
X = df[['feature1', 'feature2']]
y = df['target']

In [ ]:
from sklearn.model_selection import GridSearchCV
from sklearn.ensemble import RandomForestClassifier

output = GridSearchCV(estimator=RandomForestClassifier(), param_grid={'n_estimators': [10, 50, 100], 'max_depth': [None, 5, 10]}).fit(X, y)